load-testing/test.yml
config:
  # target: "http://localhost:3003/highlights/mySQL"
  # target: "http://localhost:3003/highlights/Cassandra"
  # target: "http://localhost:3003/main/highlights/ssr"
  # target: "http://13.56.81.37:3003/main/highlights/ssr"
  target: "http://lb-yelp-highlights-93714774.us-west-1.elb.amazonaws.com/main/highlights/ssr"
  phases:
    - duration: 10
      arrivalRate: 20
      rampTo: 30
      name: "Warm up"
    - duration: 10
      arrivalRate: 30
      name: "Sustained max load"
  processor: "./testFunctions.js"

scenarios:
  - name: "Get reviews for a business iterator"
    flow:
      - loop:
        # - function: "getRandomBusinessIterator"
        - function: "getWeightedIterator"
        - get:
            url: "/{{ iterator }}"
        count: 600
      # Print the data we're sending while debugging the script:
      # - log: "Sent a get request to /{{ iterator }}"